strategy_choices = (
    [
        "单因子-相对强弱指数RSI",
        "单因子-随机相对强弱指数StochRSI(预留A)",
        "单因子-RSRS择时(预留B)",
        "单因子-移动均线+KDJ(预留C)",
        "单因子-MACD和ADX指标(预留D)",
        "单因子-布林线均值回归(预留E)",
        "单因子-阿隆指标(趋势交易)(预留F)",
        "单因子-简单移动均线(预留G)",
        "单因子-情绪指标ARBR(预留H)",
        "单因子-市场低估值策略(预留I)",
        "机器学习-麻雀优化算法SSA(预留J)",
        "机器学习-支持向量机SVM",
        "机器学习-LSTM时序预测(预留K)",
        "机器学习-LGBM模型价格预测",
        "机器学习-随机森林模型价格预测(预留L)",
        "机器学习-线性回归价格预测(预留M)",
        "强化学习-RL模型价格预测(预留N)",
        "强化学习-Q-Leaning预测(预留O)",
        "传统策略-海龟策略(预留P)",
        "传统策略-网格策略(预留Q)",
        "组合优化-配对交易(预留R)",
        "组合优化-Kurtosis Portfolio组合策略(预留S)",
        "多因子-ROC(20)动量信号周频Top1",
        "多因子-小市值(预留T)",
        "多因子-alphalens多因子交易(预留U)",
    ],
)

trade_platforms = (
    [
        "同花顺",
        "东方财富",
        "华泰证券",
        "银河证券",
        "雪球",
        "海通证券"
        "国金证券",
        "通达信",
        "银河证券",
        "国泰君安",
        "中汇亿达",
        "恒生UFT",
        "掘金",
        "中泰XTP",
        "顶点飞创",
        "华鑫奇点",
    ],
)

btc_trade_platforms = (
    [
        "欧易OKEX",
        "火币Huobi",
        "币安Binance",
        "Bitget",
        "coinex",
        "kucoin",
        "bingx",
        "coinbase",
        "Bybit",
        "bitmart",
        "bitmex",
    ],
)

futures_trade_platforms = (["CTP", "易达", "艾克朗科", "CTPMini", "飞马Femas"],)
